In [1]:
import pandas as pd

### Series (Column of a dataframe)

List has default index starting from 0
Series can have character(or cutomised) index

In [2]:
l=[x for x in range(5)]

In [3]:
s=pd.Series(l)

In [4]:
s

0    0
1    1
2    2
3    3
4    4
dtype: int64

In [5]:
s[3]

3

In [6]:
# Series from list
s=pd.Series(l,index=['a','b','c','d','e'])
s

a    0
b    1
c    2
d    3
e    4
dtype: int64

In [7]:
s['d']

3

In [8]:
# Series from dictionary
data={'a':1,'b':2,'c':3,'d':4}
s=pd.Series(data)
s

a    1
b    2
c    3
d    4
dtype: int64

In [9]:
s=pd.Series(data,index=['a','b'])
s

a    1
b    2
dtype: int64

In [10]:
s=pd.Series(data,index=['a','b','c','f'])
s

a    1.0
b    2.0
c    3.0
f    NaN
dtype: float64

### Quering Series

In [11]:
s=pd.Series([x for x in range(1,11)])
s

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [12]:
s.iloc[0]

1

In [13]:
s.iloc[5]

6

In [14]:
s.iat[8]

9

In [15]:
s[5:9]

5    6
6    7
7    8
8    9
dtype: int64

In [16]:
s[-4:-1]

6    7
7    8
8    9
dtype: int64

In [17]:
s.where(s%2==0)

0     NaN
1     2.0
2     NaN
3     4.0
4     NaN
5     6.0
6     NaN
7     8.0
8     NaN
9    10.0
dtype: float64

In [18]:
s.where(s%2==0,'Odd Number')

0    Odd Number
1             2
2    Odd Number
3             4
4    Odd Number
5             6
6    Odd Number
7             8
8    Odd Number
9            10
dtype: object

In [19]:
s.where(s%2==0,s**2)

0     1
1     2
2     9
3     4
4    25
5     6
6    49
7     8
8    81
9    10
dtype: int64

In [20]:
s.where(s%2==0,inplace=True)
s

0     NaN
1     2.0
2     NaN
3     4.0
4     NaN
5     6.0
6     NaN
7     8.0
8     NaN
9    10.0
dtype: float64

In [21]:
s.dropna(inplace=True)
s

1     2.0
3     4.0
5     6.0
7     8.0
9    10.0
dtype: float64

In [22]:
s.fillna('Filled Value',inplace=True)
s

1     2.0
3     4.0
5     6.0
7     8.0
9    10.0
dtype: float64

### Dataframe:

In [23]:
df=pd.DataFrame()

In [24]:
type(df)

pandas.core.frame.DataFrame

In [25]:
df=pd.read_csv('data/PandasExample.csv')
df

           Name  Age  Gender
0        Nithin   24    Male
1         Manoj   30    Male
2  Shivashankar   44    Male
3        Swathi   18  Female
4   Pareekshith   28    Male

In [26]:
df.head()

           Name  Age  Gender
0        Nithin   24    Male
1         Manoj   30    Male
2  Shivashankar   44    Male
3        Swathi   18  Female
4   Pareekshith   28    Male

In [27]:
df.tail()

           Name  Age  Gender
0        Nithin   24    Male
1         Manoj   30    Male
2  Shivashankar   44    Male
3        Swathi   18  Female
4   Pareekshith   28    Male

In [28]:
df.head(2)

     Name  Age Gender
0  Nithin   24   Male
1   Manoj   30   Male

In [29]:
df.head(2)

     Name  Age Gender
0  Nithin   24   Male
1   Manoj   30   Male

In [30]:
df.iloc[0]

Name      Nithin
Age           24
Gender      Male
Name: 0, dtype: object

In [31]:
df.iloc[3]

Name      Swathi
Age           18
Gender    Female
Name: 3, dtype: object

In [32]:
df.values

array([['Nithin', 24, 'Male'],
       ['Manoj', 30, 'Male'],
       ['Shivashankar', 44, 'Male'],
       ['Swathi', 18, 'Female'],
       ['Pareekshith', 28, 'Male']], dtype=object)

In [33]:
# creating chunks
df=pd.read_csv('data/PandasExample.csv',chunksize=2)
df

In [34]:
for chunk in df:
    print(chunk)

     Name  Age Gender
0  Nithin   24   Male
1   Manoj   30   Male
           Name  Age  Gender
2  Shivashankar   44    Male
3        Swathi   18  Female
          Name  Age Gender
4  Pareekshith   28   Male

In [35]:
# Applyting age condition
df=pd.read_csv('data/PandasExample.csv')
df

           Name  Age  Gender
0        Nithin   24    Male
1         Manoj   30    Male
2  Shivashankar   44    Male
3        Swathi   18  Female
4   Pareekshith   28    Male

In [36]:
df=df[df['Age']>25]
df

           Name  Age Gender
1         Manoj   30   Male
2  Shivashankar   44   Male
4   Pareekshith   28   Male

### Pandas Panel  <br>
(creating multiple indices<br>
Accessing data from multiple indices)

In [37]:
df=pd.read_csv('data/HousePrices.csv',parse_dates=True)
df.head()

,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,condition,sqft_above,sqft_basement,yr_built,yr_renovated,street,city,statezip,country
0,2014-05-02 00:00:00,313000.0,3.0,1.50,1340,7912,1.5,0,0,3,1340,0,1955,2005,18810 Densmore Ave N,Shoreline,WA 98133,USA
1,2014-05-02 00:00:00,2384000.0,5.0,2.50,3650,9050,2.0,0,4,5,3370,280,1921,0,709 W Blaine St,Seattle,WA 98119,USA
2,2014-05-02 00:00:00,342000.0,3.0,2.00,1930,11947,1.0,0,0,4,1930,0,1966,0,26206-26214 143rd Ave SE,Kent,WA 98042,USA
3,2014-05-02 00:00:00,420000.0,3.0,2.25,2000,8030,1.0,0,0,4,1000,1000,1963,0,857 170th Pl NE,Bellevue,WA 98008,USA
4,2014-05-02 00:00:00,550000.0,4.0,2.50,1940,10500,1.0,0,0,4,1140,800,1976,1992,9105 170th Ave NE,Redmond,WA 98052,USA

In [38]:
df.columns

Index(['date', 'price', 'bedrooms', 'bathrooms', 'sqft_living', 'sqft_lot',
       'floors', 'waterfront', 'view', 'condition', 'sqft_above',
       'sqft_basement', 'yr_built', 'yr_renovated', 'street', 'city',
       'statezip', 'country'],
      dtype='object')

In [39]:
df.set_index(['city','date'],inplace=True)
df

,,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,condition,sqft_above,sqft_basement,yr_built,yr_renovated,street,statezip,country
city,date,,,,,,,,,,,,,,,,
Shoreline,2014-05-02 00:00:00,3.130000e+05,3.0,1.50,1340,7912,1.5,0,0,3,1340,0,1955,2005,18810 Densmore Ave N,WA 98133,USA
Seattle,2014-05-02 00:00:00,2.384000e+06,5.0,2.50,3650,9050,2.0,0,4,5,3370,280,1921,0,709 W Blaine St,WA 98119,USA
Kent,2014-05-02 00:00:00,3.420000e+05,3.0,2.00,1930,11947,1.0,0,0,4,1930,0,1966,0,26206-26214 143rd Ave SE,WA 98042,USA
Bellevue,2014-05-02 00:00:00,4.200000e+05,3.0,2.25,2000,8030,1.0,0,0,4,1000,1000,1963,0,857 170th Pl NE,WA 98008,USA
Redmond,2014-05-02 00:00:00,5.500000e+05,4.0,2.50,1940,10500,1.0,0,0,4,1140,800,1976,1992,9105 170th Ave NE,WA 98052,USA
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
Seattle,2014-07-09 00:00:00,3.081667e+05,3.0,1.75,1510,6360,1.0,0,0,4,1510,0,1954,1979,501 N 143rd St,WA 98133,USA
Bellevue,2014-07-09 00:00:00,5.343333e+05,3.0,2.50,1460,7573,2.0,0,0,3,1460,0,1983,2009,14855 SE 10th Pl,WA 98007,USA
Renton,2014-07-09 00:00:00,4.169042e+05,3.0,2.50,3010,7014,2.0,0,0,3,3010,0,2009,0,759 Ilwaco Pl NE,WA 98059,USA
Seattle,2014-07-10 00:00:00,2.034000e+05,4.0,2.00,2090,6630,1.0,0,0,3,1070,1020,1974,0,5148 S Creston St,WA 98178,USA
Covington,2014-07-10 00:00:00,2.206000e+05,3.0,2.50,1490,8102,2.0,0,0,4,1490,0,1990,0,18717 SE 258th St,WA 98042,USA

In [40]:
df.index

MultiIndex([(   'Shoreline', '2014-05-02 00:00:00'),
            (     'Seattle', '2014-05-02 00:00:00'),
            (        'Kent', '2014-05-02 00:00:00'),
            (    'Bellevue', '2014-05-02 00:00:00'),
            (     'Redmond', '2014-05-02 00:00:00'),
            (     'Seattle', '2014-05-02 00:00:00'),
            (     'Redmond', '2014-05-02 00:00:00'),
            ('Maple Valley', '2014-05-02 00:00:00'),
            (  'North Bend', '2014-05-02 00:00:00'),
            (     'Seattle', '2014-05-02 00:00:00'),
            ...
            (      'Renton', '2014-07-08 00:00:00'),
            (     'Seattle', '2014-07-08 00:00:00'),
            ( 'Federal Way', '2014-07-08 00:00:00'),
            (      'Auburn', '2014-07-08 00:00:00'),
            (        'Kent', '2014-07-09 00:00:00'),
            (     'Seattle', '2014-07-09 00:00:00'),
            (    'Bellevue', '2014-07-09 00:00:00'),
            (      'Renton', '2014-07-09 00:00:00'),
            (     'Seattle', '2014-07-10 00:00:00'),
            (   'Covington', '2014-07-10 00:00:00')],
           names=['city', 'date'], length=4600)

In [41]:
df.loc['Seattle']

,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,condition,sqft_above,sqft_basement,yr_built,yr_renovated,street,statezip,country
date,,,,,,,,,,,,,,,,
2014-05-02 00:00:00,2.384000e+06,5.0,2.50,3650,9050,2.0,0,4,5,3370,280,1921,0,709 W Blaine St,WA 98119,USA
2014-05-02 00:00:00,4.900000e+05,2.0,1.00,880,6380,1.0,0,0,3,880,0,1938,1994,522 NE 88th St,WA 98115,USA
2014-05-02 00:00:00,6.400000e+05,4.0,2.00,1520,6200,1.5,0,0,3,1520,0,1945,2010,6811 55th Ave NE,WA 98115,USA
2014-05-02 00:00:00,1.400000e+06,4.0,2.50,2920,4000,1.5,0,0,5,1910,1010,1909,1988,3838-4098 44th Ave NE,WA 98105,USA
2014-05-02 00:00:00,3.650000e+05,3.0,1.00,1090,6435,1.0,0,0,4,1090,0,1955,2009,2504 SW Portland Ct,WA 98106,USA
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2014-07-07 00:00:00,4.060625e+05,2.0,1.00,1290,4650,1.0,0,0,4,1290,0,1906,1990,312 NE 81st St,WA 98115,USA
2014-07-07 00:00:00,4.868950e+05,3.0,1.00,1890,3330,1.5,0,0,4,1390,500,1901,0,4324 Dayton Ave N,WA 98103,USA
2014-07-08 00:00:00,3.961667e+05,3.0,1.75,1880,5752,1.0,0,0,4,940,940,1945,0,3529 SW Webster St,WA 98126,USA
2014-07-09 00:00:00,3.081667e+05,3.0,1.75,1510,6360,1.0,0,0,4,1510,0,1954,1979,501 N 143rd St,WA 98133,USA
2014-07-10 00:00:00,2.034000e+05,4.0,2.00,2090,6630,1.0,0,0,3,1070,1020,1974,0,5148 S Creston St,WA 98178,USA

In [42]:
df.loc['Seattle'].loc['2014-07-10 00:00:00']

,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,condition,sqft_above,sqft_basement,yr_built,yr_renovated,street,statezip,country
date,,,,,,,,,,,,,,,,
2014-07-10 00:00:00,775000.0,6.0,2.75,2980,5000,1.5,0,0,3,2480,500,1916,1986,5428 Kirkwood Pl N,WA 98103,USA
2014-07-10 00:00:00,725000.0,2.0,1.75,1950,2719,1.0,0,0,5,1010,940,1919,1934,3609-3615 Whitman Ave N,WA 98103,USA
2014-07-10 00:00:00,350000.0,4.0,1.00,1170,8147,1.5,0,0,3,1170,0,1959,1989,3611 NE 137th St,WA 98125,USA
2014-07-10 00:00:00,639000.0,4.0,2.00,1840,5419,1.0,0,0,4,920,920,1942,1982,3051 36th Ave W,WA 98199,USA
2014-07-10 00:00:00,800000.0,3.0,2.75,2220,4000,2.0,0,0,3,1700,520,1914,2000,1718 32nd Ave,WA 98122,USA
2014-07-10 00:00:00,279000.0,2.0,1.00,670,6300,1.0,0,0,5,670,0,1942,0,9716 33rd Ave SW,WA 98126,USA
2014-07-10 00:00:00,880000.0,6.0,2.50,2640,3680,2.0,0,0,5,1760,880,1922,1956,3008 38th Ave SW,WA 98126,USA
2014-07-10 00:00:00,670000.0,3.0,2.50,2700,1438,2.0,0,0,3,1280,1420,2003,0,746 Boylston Ave E,WA 98102,USA
2014-07-10 00:00:00,203400.0,4.0,2.00,2090,6630,1.0,0,0,3,1070,1020,1974,0,5148 S Creston St,WA 98178,USA

### Common Functions

#### Categories

1. General Functions
    a. pivot()  : returns a reshaped DataFrame by index or column values
    b. isna(obj) : Detects missing values from an array-like object
    c. to_numeric() : converts the argument to numeric
2. Input or Output functions
    a. read_excel()
    b. DataFrame.to_excel()
    c. read_json()
    d. to_json    
3. Series functions :
    a. copy()
    b. iloc()
    c. add()
    d. mul, sub
    e. info, values, size
    f. where()
    g.iterrows()
    h. head()
4. DataFrame functions
5. Resampling 
6. Plotting

### Statistical function
1. mean()
2. median()
3. mode()
4. sum()
5. Std()
6. cov()
7. corr()
8. skew()
9. Kurt()
10. Kurtosis()
11. describe() : min,max,count,std, 25%, 50%,75%

### Date and Timedelta
1. date_range() : returns DateTimeIndex
attributes: day, date, month, hour, minute, ms, timetz, dayofweek, is_month
functions: strftime(), to_series(), to_frame

2. timedelta  : This object represents a duration, the difference two dates ot time values
attributes : days, timedelta, micro seconds, seconds
functions : isoformat(), to_pytimedelta()

### Categical Data :
by default unordered

### Iterate and Extract Data:
Index(), loc(), iloc(), iterrows(), itertuples(), apply()